api/src/loadtest.yml
config:
  target: "http://localhost:4000/api/v1"
  # target: "https://main-h5o2awvzcdhbuvqk-gtw.qovery.io/api/v1"
  phases:
    - duration: 60
      arrivalRate: 25
  variables:
    coordinates:
      - [10.7680900, 46.6283100] # Schlanders
      - [13.404954, 52.520008] # Berlin
      - [12.65689, 43.99942] # Riccione

scenarios:
  - name: "Search campings with GeoJSON point"
    flow:
      - post:
          url: "/campings"
          headers:
            X-Api-Key: "123456"
          json:
            offset: 0
            limit: 100
            location:
              geometry:
                type: "Point"
                coordinates: "{{ coordinates }}"
              maxDistance: 100